const express = require("express");// подключение express
const bodyParser = require("body-parser");
const app = express();
const fs = require("fs");

  
const urlencodedParser = bodyParser.urlencoded({extended: false});// создаем парсер для данных application/x-www-form-urlencoded

let globDate = {};
globDate.control = 4;
globDate.controlPrev = 4;
/*
const srFunc = require("./saveResFunction.js");
tabloNodeFunction.init(globDate);
console.log('setTime='+globDate.setTime);

//setInterval(updateDate, 1000);
function updateDate(){
	globDate.control++;
	tabloNodeFunction.processing(globDate);
}
*/

app.use(express.static(__dirname + "/"));
 
app.get("/", function(request, response) {
    response.sendFile(__dirname + "/setGroupPoints.html");
});

app.get("/favicon.ico", function(request, response) {
});

app.get("/*", urlencodedParser, function (request, response) {
	let arg = request.url;
	//console.log('request.url='+arg); 		//--------------------------- CheckOut ------------------------------------
	if(!(arg.includes('.html') || arg.includes('.htm') || arg.includes('.js') || arg.includes('.ico'))) arg += ".html";
	//console.log('url='+arg);			 	//--------------------------- CheckOut ------------------------------------
    response.sendFile(__dirname + arg);
});

app.post("/setData", urlencodedParser, function (request, response) {
    if(!request.body) return response.sendStatus(400);
	//console.log(" " +request.body.group + " " + request.body.index + " " + request.body.target+" "+request.body.arrow+" "+ request.body.points);
	let t = parseInt(request.body.target) - 1;
	let a = parseInt(request.body.arrow) - 1;
	let p = parseInt(request.body.points);
	archers[" " +request.body.group + " " + request.body.index + " "].arr[t][a] = p;
	let req = "";
	//console.log(" No " + t);
	let group = {};
	for(let key in archers){
		if(key.indexOf(" " +request.body.group + " ") >=0){
			if(req=="") req = "<table>";
			req += "<tr><td>" + archers[key].name + "</td><td>" + archers[key].arr[t][0] + "</td><td>" + archers[key].arr[t][1] + "</td></tr>"
			group[key] = archers[key];
		}
	}
	if(req!="") req += "</table>";
    //console.log(req);	 		//--------------------------- CheckOut ------------------------------------
	response.send(req);
	
	let jsonStringfyData = JSON.stringify(group);
	try{															//записываем новые данные в файл на случай краха
		fs.writeFileSync('group' + request.body.group + '.txt', jsonStringfyData, 'utf8');
		//console.log(jsonStringfyData);
	}catch(err){
		console.log('Ошибка записи в файл',err);
	}
});

app.post("/getDate", urlencodedParser, function (request, response) {
    if(!request.body) return response.sendStatus(400);
    //console.log("request.body.variable="+request.body.variable + ", getDate.post="+globDate[request.body.variable]); 		//--------------------------- CheckOut ------------------------------------
	response.send(""+globDate[request.body.variable]);
});

app.post("/getAllDate", urlencodedParser, function (request, response) {
    if(!request.body) return response.sendStatus(400);
	//let json = JSON.stringify(globDate);
	response.send(JSON.stringify(globDate));
});

app.listen(3000);// начинаем прослушивать подключения на 3000 порту
console.log("Начинаем прослушивать подключения на 3000 порту")

let archers = { " 1 A ":{name:" Евстратов Станислав Юрьевич ", class : " 3Д БЛ (Анлимитед) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 1 B ":{name:" Алферов Денис Игоревич ", class : " Спортинг мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 1 C ":{name:" Кузёма Александр Владимирович ", class : " Спортинг мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 12 A ":{name:" Семенова Ольга Вячеславовна ", class : " 3Д КЛ (Баребоу) женщины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 12 B ":{name:" Комаров Андрей Валерьевич ", class : " Олимпик мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 12 C ":{name:" Базарный Аркадий Николаевич ", class : " 3Д длинный лук (лонгбоу) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 3 A ":{name:" Линьков Станислав Игоревич ", class : " Историк мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 3 B ":{name:" Бойко  Анна  Игоревна  ", class : " Историк женщины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 3 C ":{name:" Изъюров Сергей Александрович ", class : " 3Д длинный лук (лонгбоу) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 4 A ":{name:" Львов Роман Сергеевич ", class : " 3Д составной лук (Инстинктив) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 4 B ":{name:" Кротов Сергей Анатольевич ", class : " 3Д длинный лук (лонгбоу) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 4 C ":{name:" Озерной Степан Максимович ", class : " 3Д БЛ (Анлимитед) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 5 A ":{name:" Полосухин Александр Викторович  ", class : " 3Д БЛ (Анлимитед) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 5 B ":{name:" Коробков Владимир Леонидович ", class : " Историк мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 5 C ":{name:" Коробков Радомир Владимирович ", class : " 3Д длинный лук (лонгбоу) юноши (17 – 14 лет) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 6 A ":{name:" Жданов Роман Викторович ", class : " Историк мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 6 B ":{name:" Александров Игорь Евгеньевич ", class : " 3Д БЛ (Анлимитед) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 6 C ":{name:" Ершов Олег Александрович ", class : " 3Д КЛ (Баребоу) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 7 A ":{name:" Шарафутдинов Ринат Фагимович ", class : " 3Д составной лук (Инстинктив) мужчины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 7 B ":{name:" Смирнова Елена Анатольевна ", class : " 3Д длинный лук (лонгбоу) женщины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 8 A ":{name:" Дьякова Ирина Сергеевна  ", class : " Олимпик женщины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
" 8 B ":{name:" Савенкова  Александра Андреевна  ", class : " 3Д БЛ (Анлимитед) женщины (21 год и старше) ", arr:[ [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], ]},
}